{
  "id": "standard_rsi_definition",
  "title": "RSI - Standard Definition and Common Misconceptions",
  "category": "education",
  "content": "RSI (Relative Strength Index) is a momentum oscillator developed by J. Welles Wilder in 1978. It measures the speed and magnitude of recent price changes to evaluate overbought or oversold conditions.\n\nSTANDARD DEFINITION:\n- RSI ranges from 0 to 100\n- Traditional overbought threshold: Above 70 (potential for price reversal DOWNWARD)\n- Traditional oversold threshold: Below 30 (potential for price reversal UPWARD)\n- Neutral zone: 30-70\n- Default calculation period: 14 days\n\nWHAT RSI ACTUALLY MEASURES:\nRSI compares the magnitude of recent gains to recent losses. It does NOT predict future prices. It identifies when price momentum has reached extreme levels that historically often lead to reversals.\n\nCOMMON MISCONCEPTIONS TO AVOID:\n1. ❌ 'RSI > 70 means strong momentum' - WRONG: It means OVERBOUGHT (too much buying, potential reversal down)\n2. ❌ 'RSI < 30 means weak stock' - WRONG: It means OVERSOLD (too much selling, potential bounce up)\n3. ❌ 'RSI predicts price direction' - WRONG: RSI measures past momentum, not future prices\n4. ❌ 'RSI divergence always works' - WRONG: Divergence can persist for long periods\n5. ❌ 'Use RSI alone for trading' - WRONG: RSI should be used with other indicators\n\nCORRECT INTERPRETATION:\n- RSI > 70: Price has risen too fast, may be due for a pullback (not a buy signal)\n- RSI < 30: Price has fallen too fast, may be due for a bounce (not automatic buy)\n- RSI climbing from below 30: Building bullish momentum\n- RSI falling from above 70: Building bearish momentum\n\nPROPER USAGE:\n1. Use RSI to identify potential reversal points, not to predict direction\n2. Always confirm RSI signals with other indicators (MACD, Volume, Price Action)\n3. In strong trends, RSI can remain overbought/oversold for extended periods\n4. Adjust thresholds for different timeframes (e.g., 80/20 for shorter periods)\n5. Look for RSI divergence (price makes new high but RSI doesn't) as warning signs\n\nIMPORTANT REMINDER:\nRSI is a lagging indicator based on historical data. Past patterns do not guarantee future results. Always use RSI as part of a comprehensive analysis, never as a standalone signal.",
  "tags": ["rsi", "momentum", "oscillator", "overbought", "oversold", "standard definition", "misconceptions", "education"]
}
