{
  "id": "support_resistance_standard",
  "title": "Support and Resistance - Standard Definition and Proper Usage",
  "category": "education",
  "content": "Support and Resistance are fundamental concepts in technical analysis representing price levels where buying (support) or selling (resistance) pressure has historically been strong enough to prevent the price from moving further.\n\nSTANDARD DEFINITIONS:\n\nSUPPORT:\n- A price level where demand is strong enough to prevent the price from falling further\n- Think of it as a 'floor' where buyers step in\n- When price approaches support, buying interest increases\n- Support can be identified where price has reversed multiple times in the past\n\nRESISTANCE:\n- A price level where selling pressure is strong enough to prevent the price from rising further\n- Think of it as a 'ceiling' where sellers step in\n- When price approaches resistance, selling interest increases\n- Resistance can be identified where price has been rejected multiple times\n\nCRITICAL CONCEPT: SUPPORT AND RESISTANCE ARE ZONES, NOT LINES\n\n❌ WRONG: 'Support is exactly at ₹150.50'\n✅ CORRECT: 'Support is in the ₹149-152 zone'\n\nWhy zones? Because:\n1. Prices are psychological levels, not exact mathematical points\n2. Market noise causes price to fluctuate around levels\n3. Different timeframes may show slightly different levels\n4. A 'test' of support can briefly dip below before recovering\n\nCOMMON MISCONCEPTIONS TO AVOID:\n\n1. ❌ 'Support always holds' - WRONG: Support CAN and DOES break\n   - When support breaks, it often becomes resistance\n   - Breaking support with high volume is a significant signal\n   - Never assume support will hold 'this time'\n\n2. ❌ 'Draw precise lines' - WRONG: Support/Resistance are ZONES\n   - Using exact prices leads to false signals\n   - A zone of 2-3% is more realistic and useful\n   - Price can wick below support and still be valid\n\n3. ❌ 'Support tested once is strong' - WRONG: Multiple touches increase validity\n   - The more times a level is tested, the more significant it becomes\n   - Single touch could be coincidence\n   - Look for 3+ touches for confirmation\n\n4. ❌ 'Support works on all timeframes equally' - WRONG: Higher timeframes are more significant\n   - Daily chart support > hourly chart support\n   - Weekly support is stronger than daily\n   - Always consider the timeframe context\n\nPROPER USAGE OF SUPPORT AND RESISTANCE:\n\n1. IDENTIFICATION:\n   - Look for areas where price has reversed multiple times\n   - Connect swing lows for support, swing highs for resistance\n   - Use zones rather than exact prices (±1-2%)\n   - Consider psychological round numbers (₹100, ₹150, ₹200)\n\n2. CONFIRMATION:\n   - Wait for price to actually reach the zone\n   - Look for reversal candlestick patterns (hammer, shooting star)\n   - Check for volume confirmation (high volume on rejection/bounce)\n   - Use other indicators for confirmation (RSI, MACD)\n\n3. TRADING APPROACH (Educational Only):\n   - Near support: Watch for bounce signals (not automatic buy)\n   - Near resistance: Watch for breakout or rejection (not automatic sell)\n   - Break of support: Often signals further downside\n   - Break of resistance: Often signals further upside\n\n4. ROLE REVERSAL:\n   - When support breaks, it often becomes new resistance\n   - When resistance breaks, it often becomes new support\n   - This concept is called ' polarity change'\n\nVOLUME CONFIRMATION:\n- Bounce off support with high volume = stronger signal\n- Break of support with high volume = more significant\n- Break of resistance with low volume = potential false breakout\n\nTIME CONSIDERATIONS:\n- Support/Resistance are more significant on higher timeframes\n- Daily chart levels are more important than 5-minute levels\n- Levels tested over months/years are stronger than weekly levels\n\nIMPORTANT REMINDERS:\n1. Support and resistance are not magical barriers - they're psychological levels\n2. Always use stop losses (in real trading) as support CAN break\n3. No support/resistance level works 100% of the time\n4. Combine with other forms of analysis (trend, volume, indicators)\n5. Past support/resistance levels do not guarantee future behavior\n\nEDUCATIONAL WARNING:\nDo not assume that because a stock bounced off support in the past, it will do so again. Market conditions change, and all technical levels can be broken. Always use comprehensive analysis and proper risk management.",
  "tags": ["support", "resistance", "zones", "price levels", "standard definition", "misconceptions", "education"]
}
